---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ContinuousFootingDefaultEndExtensionLength
source: html/12abdec5-df52-6c2d-adff-ddc98d7c5fa6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ContinuousFootingDefaultEndExtensionLength Property

"Default End Extension Length"

## Syntax (C#)
```csharp
public static ForgeTypeId ContinuousFootingDefaultEndExtensionLength { get; }
```